---
kind: type
id: T:Autodesk.Revit.DB.Visual.StoneBumpType
source: html/0d0d4222-d3b7-0745-7c4b-491ef134eae6.htm
---
# Autodesk.Revit.DB.Visual.StoneBumpType

The enumerated type representing the permitted values for the asset property "StoneBump" from the "Stone" schema.

## Syntax (C#)
```csharp
public enum StoneBumpType
```